<?php

//Рисуем прямоугольник в терминале
echo "\n -----Рисуем прямоугольник в терминале------ \n";
for($k = 0; $k < 5; $k++){
    for($i = 0; $i < 20; $i++){
        echo "*";
    }
    echo "\n";
}

//Рисуем треугольник в терминале
echo "\n -----Рисуем треугольник в терминале------ \n";
for ($k = 0; $k < 5; $k++){
    for($i = 0; $i <= $k; $i++){
        echo "*";
    }
    echo "\n";
}

echo "\n ----------- \n";

$out = '';
for ($k = 0; $k < 5; $k++){
    for($i = 0; $i <= $k; $i++){
        $out .= "*";
    }
    $out .= "\n";
}
echo $out;

echo "\n ------Таблица умножения на 7----- \n";

for($i = 0; $i <= 10; $i++){
    echo "7 * $i = ".($i * 7)."\n";
}

echo "\n ------Таблица умножения на 8----- \n";
for($i = 0; $i <= 10; $i++){
    $t = $i * 8; //вводим промежуточную переменную для упрощения записи вывода
    echo "8 * $i = $t", "\n";
}

echo "\n ------Вывод массива чисел----- \n";
for ($i = 0; $i < 5; $i++){
    for ($k = 1; $k <= 10; $k++){
        if ($i == 0 AND $k < 10) echo '0';
        echo 10 * $i + $k, " ";
    }
    echo "\n";
}
echo "\n ------Вывод того же массива чисел в обратном порядке----- \n";
for ($i = 5; $i > 0; $i--){
    for ($k = 0; $k < 10; $k++){
        echo (10 * $i - $k), " ";
        if ($i == 1 AND $k < 9) echo "0";
    }
    echo "\n";
}
echo "\n -----Рисуем трапецию в терминале------ \n";
for($k = 5; $k >= 0; $k--){
    for($i = 0; $i <= 20; $i++){
        if ($i <= $k OR $i >= 20 - $k){
            echo "_";
        }
        else {
            echo "*";
        }
    }
    echo "\n";
}

function f15(){
    for ($k = 3; $k > 0; $k--){
        for ($i = 0; $i < 9; $i++){
            if ($i < $k || $i >= 9 - $k) echo "_";
            else echo "*";
        }
        echo "\n";
    }
    echo "\n";
}

$res = f15();
echo ($res);


function f16(){
    for ($k = 0; $k < 3; $k++){
        for ($i = 0; $i < 9; $i++){
            if ($i < 3 - $k || $i >= 6 + $k) echo "_";
            else echo "*";
        }
        echo "\n";
    }
    echo "\n";
}


$res = f16();
echo ($res);

//Настраиваемая трапеция через параметр
function f17($s){
    $f = $s;
    $d = $s;
    for ($k = 0; $k < $s; $k++){
        for ($i = 0; $i < $f; $i++){
            echo "_";
        }
        for ($i = 0;  $i < $d; $i++){
            echo "*";
        }
        for ($i = 0; $i < $f; $i++){
            echo "_";
        }
        echo "\n";
        $f--;
        $d += 2;
    }
    echo "\n";
}

$res = f17(12);
echo ($res);